<?php
	header('Content-Type: text/html; charset=utf-8');
// Задача на проверку номеров телефонов
// Первый неверный вариант:
// $regexp_phone = '/^(\+7|8)(((\S?\(\S?)[0-9]{3}(\S?\(\S?))|((\S?\-\S?)[0-9]{3}(\S?\-\S?)))((\S?\-\S?)[0-9]{3}(\S?\-\S?))((\S?\-\S?)[0-9]{2}(\S?\-\S?))((\S?\-\S?)[0-9]{2}(\S?\\-\\S?))$/';  

// Массив для проверки "правильных" номеров:
$correctNumbers = [ 
    '84951234567',  '+74951234567', '8-495-1-234-567', 
    ' 8 (8122) 56-56-56', '8-911-1234567', '8 (911) 12 345 67', 
    '8-911 12 345 67', '8 (911) - 123 - 45 - 67', '+ 7 999 123 4567', 
    '8 ( 999 ) 1234567', '8 999 123 4567'
    ];
// Массив для проверки неправильных номеров:
$incorrectNumbers = [
    '02', '84951234567 позвать люсю', '849512345', '849512345678', 
    '8 (409) 123-123-123', '7900123467', '5005005001', '8888-8888-88',
    '84951a234567', '8495123456a', 
    '+1 234 5678901', /* неверный код страны */
    '+8 234 5678901', /* либо 8 либо +7 */
    '7 234 5678901' /* нет + */
    ];

// Шаблон запроса на корректность введенных данных:
$pattern = '#[(\+7)8]((\s?\d{3}\s?|(\s?\(\s?\d{3}\s?\)\s?)|(\s?\-\s?\d{3}\s?\-\s?)))(\s?\d{3}\s?)(\s?\d{2}\s?)(\s?\d{2}\s?)#';
$pattern_v2 = '#^((\+\s?7)|8)((\s?\d{3}\s?|(\s?\(\s?\d{3}\s?\)\s?)|(\s?\-\s?\d{3}\s?\-\s?)))(\s?\-?\s?\d\s?\-?\s?){6}\d$#';
$pattern_v3 = '#^((\+\s?7)|8)([-\s()]{0,3})(\d[-\s()]{0,3}){10}$#';     // +7 или 8 затем от 0 до трех любых символа и 10 раз по цифре 
                                                                        // и от 0 до 3 любых символа 

// Шаблон для приведения к нормальной форме:
$pattern_normal = array ('#(\D)#',
                        '#^((\+?7)|8)#');

echo "Проверка корректных номеров:<br>";
check($correctNumbers, $pattern_v2, $pattern_normal);
echo "Проверка некорректных номеров:<br>";
check($incorrectNumbers, $pattern_v2, $pattern_normal);

// пишем функцию проверки
function check($mas, $pattern, $norm){
    foreach ($mas as $key => $value) {
        if(preg_match($pattern, $value, $mathes))
            {
                $replace = array ('', '8');             // Двойная замена шаблоном
                $mathes[0] = preg_replace ($norm, $replace, $mathes[0]);
                echo "Номер телефона '$value' корректный. Нормальная форма: $mathes[0]<br>";
            }
        else echo "Номер телефона '$value' некорректный:с<br>";
    }
    echo "<br>";
}
?>